MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0G3519/mcu.h
/* IOMUX_PINCM77[PF] Bits */
#define IOMUX_PINCM77_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM77_PF_GPIOC_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM77_PF_I2C2_SDA                     ((uint32_t)0X00000002)
#define IOMUX_PINCM77_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM77_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM77_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM77_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM78[PF] Bits */
#define IOMUX_PINCM78_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM78_PF_GPIOC_DIO04                  ((uint32_t)0X00000001)
#define IOMUX_PINCM78_PF_UART3_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM78_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM78_PF_TIMA_FAULT2                  ((uint32_t)0X00000004)
#define IOMUX_PINCM78_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM78_PF_TIMG14_CCP2                  ((uint32_t)0X00000007)

/* IOMUX_PINCM79[PF] Bits */
#define IOMUX_PINCM79_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM79_PF_GPIOC_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM79_PF_UART3_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM79_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM79_PF_TIMG8_IDX                    ((uint32_t)0X00000004)
#define IOMUX_PINCM79_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM79_PF_TIMG14_CCP3                  ((uint32_t)0X00000007)

/* IOMUX_PINCM80[PF] Bits */
#define IOMUX_PINCM80_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM80_PF_GPIOC_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM80_PF_CANFD1_CANTX                 ((uint32_t)0X00000007)

/* IOMUX_PINCM81[PF] Bits */
#define IOMUX_PINCM81_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM81_PF_GPIOC_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM81_PF_CANFD1_CANRX                 ((uint32_t)0X00000007)

/* IOMUX_PINCM82[PF] Bits */
#define IOMUX_PINCM82_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM82_PF_GPIOC_DIO23                  ((uint32_t)0X00000001)

/* IOMUX_PINCM83[PF] Bits */
#define IOMUX_PINCM83_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM83_PF_GPIOC_DIO24                  ((uint32_t)0X00000001)

/* IOMUX_PINCM84[PF] Bits */
#define IOMUX_PINCM84_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM84_PF_GPIOC_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM84_PF_UART3_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM84_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM84_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM84_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM85[PF] Bits */
#define IOMUX_PINCM85_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM85_PF_GPIOC_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM85_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM85_PF_SPI0_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM85_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM85_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM86[PF] Bits */
#define IOMUX_PINCM86_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM86_PF_GPIOC_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM86_PF_UART3_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM86_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM86_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM87[PF] Bits */
#define IOMUX_PINCM87_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM87_PF_GPIOC_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM87_PF_UART3_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM87_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM87_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM88[PF] Bits */
#define IOMUX_PINCM88_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM88_PF_GPIOC_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM88_PF_TIMG9_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM88_PF_UART6_RX                     ((uint32_t)0X00000008)

/* IOMUX_PINCM89[PF] Bits */
#define IOMUX_PINCM89_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM89_PF_GPIOC_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM89_PF_TIMG9_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM89_PF_UART6_TX                     ((uint32_t)0X00000008)

/* IOMUX_PINCM90[PF] Bits */
#define IOMUX_PINCM90_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM90_PF_GPIOC_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM90_PF_TIMG9_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM90_PF_UART6_CTS                    ((uint32_t)0X00000008)

/* IOMUX_PINCM91[PF] Bits */
#define IOMUX_PINCM91_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM91_PF_GPIOC_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM91_PF_CANFD1_CANTX                 ((uint32_t)0X00000007)
#define IOMUX_PINCM91_PF_UART6_RTS                    ((uint32_t)0X00000008)

/* IOMUX_PINCM92[PF] Bits */
#define IOMUX_PINCM92_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM92_PF_GPIOC_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM92_PF_CANFD1_CANRX                 ((uint32_t)0X00000007)

/* IOMUX_PINCM93[PF] Bits */
#define IOMUX_PINCM93_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM93_PF_GPIOC_DIO28                  ((uint32_t)0X00000001)
#define IOMUX_PINCM93_PF_UART5_RX                     ((uint32_t)0X00000007)

/* IOMUX_PINCM94[PF] Bits */
#define IOMUX_PINCM94_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM94_PF_GPIOC_DIO29                  ((uint32_t)0X00000001)
#define IOMUX_PINCM94_PF_UART5_TX                     ((uint32_t)0X00000007)


#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0G351X_PeripheralDecl */

/*@}*/ /* end of group MSPM0G351X_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0g351x__include */

